"""
در پایتون، می‌توان از عملگرهای مقایسه‌ای به صورت زنجیره‌ای (Chaining) استفاده کرد. به عنوان مثال، عبارت a < b <= c معادل دو مقایسه جداگانه است: a < b و b <= c. این امکان را به شما می‌دهد که چندین مقایسه را در یک عبارت واحد انجام دهید.

وظیفه شما: برنامه‌ای بنویسید که سه عدد ورودی دریافت کند و بررسی کند که آیا عدد اول کمتر از عدد دوم و عدد دوم کمتر یا مساوی عدد سوم است یا خیر.

ورودی‌ها:

سه عدد صحیح به نام‌های a, b و c.

خروجی‌ها:

اگر شرط a < b <= c برقرار باشد، خروجی True را نمایش دهید.
در غیر این صورت، خروجی False را نمایش دهید.

ورودی نمونه:

a = 5
b = 10
c = 15

خروجی نمونه :

True"""
a, b, c = map(int, input("Enter three numbers: ").split())
print(a < b <= c)