"""یک جادوگر دو مجموعه جادویی به نام‌های SetA و SetB دارد. هر کدام از این مجموعه‌ها شامل چند عدد مختلف هستند. جادوگر باید دو کار انجام دهد:

SetA = {1, 2, 3, 4}
SetB = {3, 4, 5, 6}



جادوگر باید مجموعه‌ی مشترک (اشتراک) بین SetA و SetB را پیدا کند.
سپس باید تمامی اعضای موجود در هر دو مجموعه (اجتماع) را مشخص کند.
وظیفه شما: برنامه‌ای بنویسید که:

مجموعه مشترک (اشتراک) بین SetA و SetB را پیدا کند.
تمامی اعضای موجود در هر دو مجموعه (اجتماع) را پیدا کند.
خروجی مورد 1 و 2 را نمایش دهد."""
SetA = set()
SetB = set()
SetA = {1, 2, 3, 4}
SetB = {3, 4, 5, 6}
print(type(SetB))
print(type(SetA))

print(SetA.intersection(SetB))
print(SetA.union(SetB))