"""
یک ماشین به نام "ماشین جادویی" داریم که به یک عدد اولیه n می‌رسد و می‌خواهد به 1 برسد. ماشین می‌تواند دو کار انجام دهد:

اگر عدد فعلی بر ۲ بخش‌پذیر باشد، آن را نصف می‌کند.
اگر عدد فعلی بر ۲ بخش‌پذیر نباشد، عدد را ضربدر ۳ کرده و ۱ را از آن کم می‌کند.
وظیفه شما این است که برنامه‌ای بنویسید که عدد اولیه n را از ورودی دریافت کرده و نشان دهد که چگونه ماشین به 1 می‌رسد.

ورودی:

یک عدد صحیح n (۲ ≤ n ≤ ۱۰۰۰)

خروجی:

در هر مرحله، مقدار فعلی عدد n را چاپ کنید تا وقتی که عدد به ۱ برسد. ورودی نمونه:

50

خروجی نمونه:

5
16
8
4
2
1"""
n = int(input("choose number between 2 and 1000 : "))
if 2 <= n <= 1000:
    while n != 1:
        if n % 2 == 0:
            n = n // 2
        else:
            n = n * 3 + 1
        print(n)
else:
    print("you choose a number which is not between 2 and 1000")
