"""
نمایش محتوای دوره

یک جادوگر تصمیم گرفته است که با استفاده از یک طلسم خاص، قدرت اعداد را افزایش دهد! او یک عدد n را انتخاب می‌کند و سپس برای n مرحله، کارهای زیر را انجام می‌دهد:

اگر عدد فرد باشد، مقدار آن را دو برابر کرده و 1 واحد کم می‌کند.
اگر عدد زوج باشد، مقدار آن را نصف می‌کند.
جادوگر این عملیات را دقیقاً n بار انجام می‌دهد.
📝 ورودی:

عدد صحیح n که تعداد مراحل را مشخص می‌کند (1 ≤ n ≤ 20).
عدد صحیح x که مقدار اولیه است (1 ≤ x ≤ 1000).
📤 خروجی:

در انتها مقدار نهایی x را نمایش بده.
ورودی 1:

5
10


خروجی 1:

65"""

n = int(input('how many times we have operation, choose between 1 to 20 :'))
x = int(input("choose your number between 1 to 1000 :"))
if 1 <= n and n <= 20 and x >= 1 and x <= 1000:
    for _ in range(n):
        if x % 2 != 0:
            x = x * 2 - 1
        elif x % 2 == 0:
            x = x // 2
    print(f"the last number is your {x}")
else:
    print("you choose wrong number")

